SkydiverMCU/mcu-iap-demo/Cortex-M0/MM32G0020/MM32G0020_Application/Device/MM32G0020/Include/reg_uart.h

/***********************************************************************************************************************
    @file     reg_uart.h
    @author   VV TEAM
    @brief    This flie contains all the UART's register and its field definition.
  **********************************************************************************************************************
    @attention

    <h2><center>&copy; Copyright(c) <2023> <MindMotion></center></h2>

      Redistribution and use in source and binary forms, with or without modification, are permitted provided that the
    following conditions are met:
    1. Redistributions of source code must retain the above copyright notice,
       this list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, this list of conditions and
       the following disclaimer in the documentation and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors may be used to endorse or
       promote products derived from this software without specific prior written permission.

      THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
    INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
    DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
    SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
    SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
    WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
    OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *********************************************************************************************************************/

/* Define to prevent recursive inclusion -----------------------------------------------------------------------------*/
#ifndef __REG_UART_H
#define __REG_UART_H

/* Files includes ----------------------------------------------------------------------------------------------------*/
#include "core_cm0.h"

/**
  * @brief UART Base Address Definition
  */
#define  UART2_BASE                                0x40004400                                       /*!<Base Address: 0x40004400*/
#define  UART1_BASE                                0x40013800                                       /*!<Base Address: 0x40013800*/

/**
  * @brief UART Register Structure Definition
  */
typedef struct
{
    __IO uint32_t TDR;                            /*!<UART UART Transmission Data Register           offset: 0x00       */
    __IO uint32_t RDR;                            /*!<UART UART Receipt Data Register                offset: 0x04       */
    __IO uint32_t CSR;                            /*!<UART UART Current Status Register              offset: 0x08       */
    __IO uint32_t ISR;                            /*!<UART UART Interrupt Status Register            offset: 0x0C       */
    __IO uint32_t IER;                            /*!<UART UART Interrupt Enable Register            offset: 0x10       */
    __IO uint32_t ICR;                            /*!<UART UART Interrupt Clear Register             offset: 0x14       */
    __IO uint32_t GCR;                            /*!<UART UART Global Control Register              offset: 0x18       */
    __IO uint32_t CCR;                            /*!<UART UART Universal Control Register           offset: 0x1C       */
    __IO uint32_t BRR;                            /*!<UART UART Baud Rate Register                   offset: 0x20       */
    __IO uint32_t FRA;                            /*!<UART UART Fraction Baud Rate Register          offset: 0x24       */
    __IO uint32_t RXADDR;                         /*!<UART UART Receipt Address Register             offset: 0x28       */
    __IO uint32_t RXMASK;                         /*!<UART UART Receipt Mask Register                offset: 0x2C       */
    __IO uint32_t SCR;                            /*!<UART UART SCR Register                         offset: 0x30       */
    __IO uint32_t IDLR;                           /*!<UART UART Idle Data Length Register            offset: 0x34       */
    __IO uint32_t ABRCR;                          /*!<UART UART Auto Baud Rate Control Register      offset: 0x38       */
} UART_TypeDef;

/**
  * @brief UART type pointer Definition
  */
#define UART2                                     ((UART_TypeDef *)UART2_BASE)
#define UART1                                     ((UART_TypeDef *)UART1_BASE)

/**
  * @brief UART_TDR Register Bit Definition
  */
#define  UART_TDR_TXREG_Pos                       (0)
#define  UART_TDR_TXREG_Msk                       (0x1FFU << UART_TDR_TXREG_Pos)                    /*!<Transmission data register*/
#define  UART_TDR_TXREG                           UART_TDR_TXREG_Msk
#define  UART_TDR_TXREG_0                         (0x001U << UART_TDR_TXREG_Pos) 
#define  UART_TDR_TXREG_1                         (0x002U << UART_TDR_TXREG_Pos) 
#define  UART_TDR_TXREG_2                         (0x004U << UART_TDR_TXREG_Pos) 
#define  UART_TDR_TXREG_3                         (0x008U << UART_TDR_TXREG_Pos) 
#define  UART_TDR_TXREG_4                         (0x010U << UART_TDR_TXREG_Pos) 
#define  UART_TDR_TXREG_5                         (0x020U << UART_TDR_TXREG_Pos) 
#define  UART_TDR_TXREG_6                         (0x040U << UART_TDR_TXREG_Pos) 
#define  UART_TDR_TXREG_7                         (0x080U << UART_TDR_TXREG_Pos) 
#define  UART_TDR_TXREG_8                         (0x100U << UART_TDR_TXREG_Pos) 

/**
  * @brief UART_RDR Register Bit Definition
  */
#define  UART_RDR_RXREG_Pos                       (0)
#define  UART_RDR_RXREG_Msk                       (0x1FFU << UART_RDR_RXREG_Pos)                    /*!<Receipt data register This register is only readable*/
#define  UART_RDR_RXREG                           UART_RDR_RXREG_Msk
#define  UART_RDR_RXREG_0                         (0x001U << UART_RDR_RXREG_Pos) 
#define  UART_RDR_RXREG_1                         (0x002U << UART_RDR_RXREG_Pos) 
#define  UART_RDR_RXREG_2                         (0x004U << UART_RDR_RXREG_Pos) 
#define  UART_RDR_RXREG_3                         (0x008U << UART_RDR_RXREG_Pos) 
#define  UART_RDR_RXREG_4                         (0x010U << UART_RDR_RXREG_Pos) 
#define  UART_RDR_RXREG_5                         (0x020U << UART_RDR_RXREG_Pos) 
#define  UART_RDR_RXREG_6                         (0x040U << UART_RDR_RXREG_Pos) 
#define  UART_RDR_RXREG_7                         (0x080U << UART_RDR_RXREG_Pos) 
#define  UART_RDR_RXREG_8                         (0x100U << UART_RDR_RXREG_Pos) 

/**
  * @brief UART_CSR Register Bit Definition
  */
#define  UART_CSR_TXC_Pos                         (0)
#define  UART_CSR_TXC_Msk                         (0x1U << UART_CSR_TXC_Pos)                        /*!<Transmission complete flag bit*/
#define  UART_CSR_TXC                             UART_CSR_TXC_Msk
#define  UART_CSR_RXAVL_Pos                       (1)
#define  UART_CSR_RXAVL_Msk                       (0x1U << UART_CSR_RXAVL_Pos)                      /*!<Receipt valid data flag bit When the receipt buffer receives a complete byte data, the bit is asserted.*/
#define  UART_CSR_RXAVL                           UART_CSR_RXAVL_Msk
#define  UART_CSR_TXFULL_Pos                      (2)
#define  UART_CSR_TXFULL_Msk                      (0x1U << UART_CSR_TXFULL_Pos)                     /*!<Transmission buffer full flag bit*/
#define  UART_CSR_TXFULL                          UART_CSR_TXFULL_Msk
#define  UART_CSR_TXEPT_Pos                       (3)
#define  UART_CSR_TXEPT_Msk                       (0x1U << UART_CSR_TXEPT_Pos)                      /*!<Transmission buffer empty flag bit*/
#define  UART_CSR_TXEPT                           UART_CSR_TXEPT_Msk

/**
  * @brief UART_ISR Register Bit Definition
  */
#define  UART_ISR_TX_INTF_Pos                     (0)
#define  UART_ISR_TX_INTF_Msk                     (0x1U << UART_ISR_TX_INTF_Pos)                    /*!<Transmission buffer empty interrupt flag bit*/
#define  UART_ISR_TX_INTF                         UART_ISR_TX_INTF_Msk
#define  UART_ISR_RX_INTF_Pos                     (1)
#define  UART_ISR_RX_INTF_Msk                     (0x1U << UART_ISR_RX_INTF_Pos)                    /*!<Receipt valid data interrupt flag bit The bit is asserted when the receipt buffer receives a complete byte data.*/
#define  UART_ISR_RX_INTF                         UART_ISR_RX_INTF_Msk
#define  UART_ISR_TXC_INTF_Pos                    (2)
#define  UART_ISR_TXC_INTF_Msk                    (0x1U << UART_ISR_TXC_INTF_Pos)                   /*!<UART transmission shift register end interrupt flag bit*/
#define  UART_ISR_TXC_INTF                        UART_ISR_TXC_INTF_Msk
#define  UART_ISR_RXOERR_INTF_Pos                 (3)
#define  UART_ISR_RXOERR_INTF_Msk                 (0x1U << UART_ISR_RXOERR_INTF_Pos)                /*!<Receipt overflow error interrupt flag bit It is asserted only in case of autoflowen=0*/
#define  UART_ISR_RXOERR_INTF                     UART_ISR_RXOERR_INTF_Msk
#define  UART_ISR_RXPERR_INTF_Pos                 (4)
#define  UART_ISR_RXPERR_INTF_Msk                 (0x1U << UART_ISR_RXPERR_INTF_Pos)                /*!<Parity check error interrupt flag bit*/
#define  UART_ISR_RXPERR_INTF                     UART_ISR_RXPERR_INTF_Msk
#define  UART_ISR_RXFERR_INTF_Pos                 (5)
#define  UART_ISR_RXFERR_INTF_Msk                 (0x1U << UART_ISR_RXFERR_INTF_Pos)                /*!<Frame error interrupt flag bit Frame error occurs in the detection of anomaly stop bit.*/
#define  UART_ISR_RXFERR_INTF                     UART_ISR_RXFERR_INTF_Msk
#define  UART_ISR_RXBRK_INTF_Pos                  (6)
#define  UART_ISR_RXBRK_INTF_Msk                  (0x1U << UART_ISR_RXBRK_INTF_Pos)                 /*!<UART receipt frame break interrupt flag bit After the anomaly stop bit, RX pin receives 10 or more than 10 bit low levels after a while.*/
#define  UART_ISR_RXBRK_INTF                      UART_ISR_RXBRK_INTF_Msk
#define  UART_ISR_TXBRK_INTF_Pos                  (7)
#define  UART_ISR_TXBRK_INTF_Msk                  (0x1U << UART_ISR_TXBRK_INTF_Pos)                 /*!<UART Break frame transmission end interrupt flag bit*/
#define  UART_ISR_TXBRK_INTF                      UART_ISR_TXBRK_INTF_Msk
#define  UART_ISR_RXB8_INTF_Pos                   (8)
#define  UART_ISR_RXB8_INTF_Msk                   (0x1U << UART_ISR_RXB8_INTF_Pos)                  /*!<UART sync frame interrupt flag bit In the 9 bit communication mode, when the 9th bit data received is sames as the register CCR.B8POL, RXB8_INT is asserted. The bit can serve as the interrupt request signal*/
#define  UART_ISR_RXB8_INTF                       UART_ISR_RXB8_INTF_Msk
#define  UART_ISR_RXIDLE_INTF_Pos                 (9)
#define  UART_ISR_RXIDLE_INTF_Msk                 (0x1U << UART_ISR_RXIDLE_INTF_Pos)                /*!<UART receipt frame idle interrupt flag bit After the stop bit, RX pin receives several (UART_IDLR) high levels after a while.*/
#define  UART_ISR_RXIDLE_INTF                     UART_ISR_RXIDLE_INTF_Msk
#define  UART_ISR_ABREND_INTF_Pos                 (10)
#define  UART_ISR_ABREND_INTF_Msk                 (0x1U << UART_ISR_ABREND_INTF_Pos)                /*!<UART auto baud rate end interrupt flag bit*/
#define  UART_ISR_ABREND_INTF                     UART_ISR_ABREND_INTF_Msk
#define  UART_ISR_ABRERR_INTF_Pos                 (11)
#define  UART_ISR_ABRERR_INTF_Msk                 (0x1U << UART_ISR_ABRERR_INTF_Pos)                /*!<UART auto baud rate error interrupt flag bit*/
#define  UART_ISR_ABRERR_INTF                     UART_ISR_ABRERR_INTF_Msk

/**
  * @brief UART_IER Register Bit Definition
  */
#define  UART_IER_TX_IEN_Pos                      (0)
#define  UART_IER_TX_IEN_Msk                      (0x1U << UART_IER_TX_IEN_Pos)                     /*!<Transmission buffer empty interrupt enable bit*/
#define  UART_IER_TX_IEN                          UART_IER_TX_IEN_Msk
#define  UART_IER_RX_IEN_Pos                      (1)
#define  UART_IER_RX_IEN_Msk                      (0x1U << UART_IER_RX_IEN_Pos)                     /*!<Receipt buffer interrupt enable bit*/
#define  UART_IER_RX_IEN                          UART_IER_RX_IEN_Msk
#define  UART_IER_TXC_IEN_Pos                     (2)
#define  UART_IER_TXC_IEN_Msk                     (0x1U << UART_IER_TXC_IEN_Pos)                    /*!<UART transmission shift register end interrupt enable control bit*/
#define  UART_IER_TXC_IEN                         UART_IER_TXC_IEN_Msk
#define  UART_IER_RXOERR_IEN_Pos                  (3)
#define  UART_IER_RXOERR_IEN_Msk                  (0x1U << UART_IER_RXOERR_IEN_Pos)                 /*!<Receipt overflow error interrupt enable bit*/
#define  UART_IER_RXOERR_IEN                      UART_IER_RXOERR_IEN_Msk
#define  UART_IER_RXPERR_IEN_Pos                  (4)
#define  UART_IER_RXPERR_IEN_Msk                  (0x1U << UART_IER_RXPERR_IEN_Pos)                 /*!<Parity error interrupt enable bit*/
#define  UART_IER_RXPERR_IEN                      UART_IER_RXPERR_IEN_Msk
#define  UART_IER_RXFERR_IEN_Pos                  (5)
#define  UART_IER_RXFERR_IEN_Msk                  (0x1U << UART_IER_RXFERR_IEN_Pos)                 /*!<Frame error interrupt enable bit*/
#define  UART_IER_RXFERR_IEN                      UART_IER_RXFERR_IEN_Msk
#define  UART_IER_RXBRK_IEN_Pos                   (6)
#define  UART_IER_RXBRK_IEN_Msk                   (0x1U << UART_IER_RXBRK_IEN_Pos)                  /*!<UART receipt Break frame interrupt enable bit*/
#define  UART_IER_RXBRK_IEN                       UART_IER_RXBRK_IEN_Msk
#define  UART_IER_TXBRK_IEN_Pos                   (7)
#define  UART_IER_TXBRK_IEN_Msk                   (0x1U << UART_IER_TXBRK_IEN_Pos)                  /*!<UART Break frame transmission end interrupt enable bit*/
#define  UART_IER_TXBRK_IEN                       UART_IER_TXBRK_IEN_Msk
#define  UART_IER_RXB8_IEN_Pos                    (8)
#define  UART_IER_RXB8_IEN_Msk                    (0x1U << UART_IER_RXB8_IEN_Pos)                   /*!<UART sync frame interrupt enable bit*/
#define  UART_IER_RXB8_IEN                        UART_IER_RXB8_IEN_Msk
#define  UART_IER_RXIDLE_IEN_Pos                  (9)
#define  UART_IER_RXIDLE_IEN_Msk                  (0x1U << UART_IER_RXIDLE_IEN_Pos)                 /*!<Receipt frame idle interrupt enable bit*/
#define  UART_IER_RXIDLE_IEN                      UART_IER_RXIDLE_IEN_Msk
#define  UART_IER_ABREND_IEN_Pos                  (10)
#define  UART_IER_ABREND_IEN_Msk                  (0x1U << UART_IER_ABREND_IEN_Pos)                 /*!<Auto baud rate end enable bit*/
#define  UART_IER_ABREND_IEN                      UART_IER_ABREND_IEN_Msk
#define  UART_IER_ABRERR_IEN_Pos                  (11)
#define  UART_IER_ABRERR_IEN_Msk                  (0x1U << UART_IER_ABRERR_IEN_Pos)                 /*!<Auto baud rate error enable bit*/
#define  UART_IER_ABRERR_IEN                      UART_IER_ABRERR_IEN_Msk

/**
  * @brief UART_ICR Register Bit Definition
  */
#define  UART_ICR_TX_ICLR_Pos                     (0)
#define  UART_ICR_TX_ICLR_Msk                     (0x1U << UART_ICR_TX_ICLR_Pos)                    /*!<Transmission buffer empty interrupt clear bit*/
#define  UART_ICR_TX_ICLR                         UART_ICR_TX_ICLR_Msk
#define  UART_ICR_RX_ICLR_Pos                     (1)
#define  UART_ICR_RX_ICLR_Msk                     (0x1U << UART_ICR_RX_ICLR_Pos)                    /*!<Receipt interrupt clear bit*/
#define  UART_ICR_RX_ICLR                         UART_ICR_RX_ICLR_Msk
#define  UART_ICR_TXC_ICLR_Pos                    (2)
#define  UART_ICR_TXC_ICLR_Msk                    (0x1U << UART_ICR_TXC_ICLR_Pos)                   /*!<Transmission end interrupt clear bit*/
#define  UART_ICR_TXC_ICLR                        UART_ICR_TXC_ICLR_Msk
#define  UART_ICR_RXOERR_ICLR_Pos                 (3)
#define  UART_ICR_RXOERR_ICLR_Msk                 (0x1U << UART_ICR_RXOERR_ICLR_Pos)                /*!<Receipt overflow error interrupt clear bit*/
#define  UART_ICR_RXOERR_ICLR                     UART_ICR_RXOERR_ICLR_Msk
#define  UART_ICR_RXPERR_ICLR_Pos                 (4)
#define  UART_ICR_RXPERR_ICLR_Msk                 (0x1U << UART_ICR_RXPERR_ICLR_Pos)                /*!<Parity error interrupt clear bit*/
#define  UART_ICR_RXPERR_ICLR                     UART_ICR_RXPERR_ICLR_Msk
#define  UART_ICR_RXFERR_ICLR_Pos                 (5)
#define  UART_ICR_RXFERR_ICLR_Msk                 (0x1U << UART_ICR_RXFERR_ICLR_Pos)                /*!<Frame error interrupt enable bit*/
#define  UART_ICR_RXFERR_ICLR                     UART_ICR_RXFERR_ICLR_Msk
#define  UART_ICR_RXBRK_ICLR_Pos                  (6)
#define  UART_ICR_RXBRK_ICLR_Msk                  (0x1U << UART_ICR_RXBRK_ICLR_Pos)                 /*!<UART receipt Break frame interrupt clear bit*/
#define  UART_ICR_RXBRK_ICLR                      UART_ICR_RXBRK_ICLR_Msk
#define  UART_ICR_TXBRK_ICLR_Pos                  (7)
#define  UART_ICR_TXBRK_ICLR_Msk                  (0x1U << UART_ICR_TXBRK_ICLR_Pos)                 /*!<UART Break frame transmission end interrupt flag clear control bit.*/
#define  UART_ICR_TXBRK_ICLR                      UART_ICR_TXBRK_ICLR_Msk
#define  UART_ICR_RXB8_ICLR_Pos                   (8)
#define  UART_ICR_RXB8_ICLR_Msk                   (0x1U << UART_ICR_RXB8_ICLR_Pos)                  /*!<UART sync frame interrupt flag clear control bit*/
#define  UART_ICR_RXB8_ICLR                       UART_ICR_RXB8_ICLR_Msk
#define  UART_ICR_RXIDLE_ICLR_Pos                 (9)
#define  UART_ICR_RXIDLE_ICLR_Msk                 (0x1U << UART_ICR_RXIDLE_ICLR_Pos)                /*!<UART receipt frame idle interrupt clear bit*/
#define  UART_ICR_RXIDLE_ICLR                     UART_ICR_RXIDLE_ICLR_Msk
#define  UART_ICR_ABREND_ICLR_Pos                 (10)
#define  UART_ICR_ABREND_ICLR_Msk                 (0x1U << UART_ICR_ABREND_ICLR_Pos)                /*!<UART auto baud rate end clear bit*/
#define  UART_ICR_ABREND_ICLR                     UART_ICR_ABREND_ICLR_Msk
#define  UART_ICR_ABRERR_ICLR_Pos                 (11)
#define  UART_ICR_ABRERR_ICLR_Msk                 (0x1U << UART_ICR_ABRERR_ICLR_Pos)                /*!<UART auto baud rate error clear bit*/
#define  UART_ICR_ABRERR_ICLR                     UART_ICR_ABRERR_ICLR_Msk

/**
  * @brief UART_GCR Register Bit Definition
  */
#define  UART_GCR_UARTEN_Pos                      (0)
#define  UART_GCR_UARTEN_Msk                      (0x1U << UART_GCR_UARTEN_Pos)                     /*!<UART module selection bit*/
#define  UART_GCR_UARTEN                          UART_GCR_UARTEN_Msk
#define  UART_GCR_RXEN_Pos                        (3)
#define  UART_GCR_RXEN_Msk                        (0x1U << UART_GCR_RXEN_Pos)                       /*!<Receipt enable bit*/
#define  UART_GCR_RXEN                            UART_GCR_RXEN_Msk
#define  UART_GCR_TXEN_Pos                        (4)
#define  UART_GCR_TXEN_Msk                        (0x1U << UART_GCR_TXEN_Pos)                       /*!<Transmission enable bit*/
#define  UART_GCR_TXEN                            UART_GCR_TXEN_Msk
#define  UART_GCR_SELB8_Pos                       (7)
#define  UART_GCR_SELB8_Msk                       (0x1U << UART_GCR_SELB8_Pos)                      /*!<Selection B8 data receipt or transmission valid or not*/
#define  UART_GCR_SELB8                           UART_GCR_SELB8_Msk
#define  UART_GCR_SWAP_Pos                        (8)
#define  UART_GCR_SWAP_Msk                        (0x1U << UART_GCR_SWAP_Pos)                       /*!<Input and output exchange*/
#define  UART_GCR_SWAP                            UART_GCR_SWAP_Msk
#define  UART_GCR_RXTOG_Pos                       (9)
#define  UART_GCR_RXTOG_Msk                       (0x1U << UART_GCR_RXTOG_Pos)                      /*!<Receipt inversion*/
#define  UART_GCR_RXTOG                           UART_GCR_RXTOG_Msk
#define  UART_GCR_TXTOG_Pos                       (10)
#define  UART_GCR_TXTOG_Msk                       (0x1U << UART_GCR_TXTOG_Pos)                      /*!<Transmission inversion bit*/
#define  UART_GCR_TXTOG                           UART_GCR_TXTOG_Msk

