SkydiverMCU/mcu-iap-demo/Cortex-M0/MM32G0020/MM32G0020_Application/Device/MM32G0020/Include/reg_uart.h
/**
  * @brief UART_CCR Register Bit Definition
  */
#define  UART_CCR_PEN_Pos                         (0)
#define  UART_CCR_PEN_Msk                         (0x1U << UART_CCR_PEN_Pos)                        /*!<Parity enable bit*/
#define  UART_CCR_PEN                             UART_CCR_PEN_Msk
#define  UART_CCR_PSEL_Pos                        (1)
#define  UART_CCR_PSEL_Msk                        (0x1U << UART_CCR_PSEL_Pos)                       /*!<Check selection bit After the parity check enable, this bit is used to select whether to use even check or odd check.*/
#define  UART_CCR_PSEL                            UART_CCR_PSEL_Msk
#define  UART_CCR_SPB0_Pos                        (2)
#define  UART_CCR_SPB0_Msk                        (0x1U << UART_CCR_SPB0_Pos)                       /*!<Stop bit selection Set transmission stop bit.*/
#define  UART_CCR_SPB0                            UART_CCR_SPB0_Msk
#define  UART_CCR_BRK_Pos                         (3)
#define  UART_CCR_BRK_Msk                         (0x1U << UART_CCR_BRK_Pos)                        /*!<UART transmission Break frame*/
#define  UART_CCR_BRK                             UART_CCR_BRK_Msk
#define  UART_CCR_CHAR_Pos                        (4)
#define  UART_CCR_CHAR_Msk                        (0x3U << UART_CCR_CHAR_Pos)                       /*!<UART data width bit*/
#define  UART_CCR_CHAR                            UART_CCR_CHAR_Msk
#define  UART_CCR_CHAR_0                          (0x1U << UART_CCR_CHAR_Pos) 
#define  UART_CCR_CHAR_1                          (0x2U << UART_CCR_CHAR_Pos) 
#define  UART_CCR_SPB1_Pos                        (6)
#define  UART_CCR_SPB1_Msk                        (0x1U << UART_CCR_SPB1_Pos)                       /*!<Stop selection bit, plus SPB0, set the stop bit.*/
#define  UART_CCR_SPB1                            UART_CCR_SPB1_Msk
#define  UART_CCR_B8RXD_Pos                       (7)
#define  UART_CCR_B8RXD_Msk                       (0x1U << UART_CCR_B8RXD_Pos)                      /*!<UART sync frame receipt data 9th bit Only readable*/
#define  UART_CCR_B8RXD                           UART_CCR_B8RXD_Msk
#define  UART_CCR_B8TXD_Pos                       (8)
#define  UART_CCR_B8TXD_Msk                       (0x1U << UART_CCR_B8TXD_Pos)                      /*!<UART sync frame transmission data 9th bit*/
#define  UART_CCR_B8TXD                           UART_CCR_B8TXD_Msk
#define  UART_CCR_B8POL_Pos                       (9)
#define  UART_CCR_B8POL_Msk                       (0x1U << UART_CCR_B8POL_Pos)                      /*!<UART sync frame 9th bit polarity control bit*/
#define  UART_CCR_B8POL                           UART_CCR_B8POL_Msk
#define  UART_CCR_B8TOG_Pos                       (10)
#define  UART_CCR_B8TOG_Msk                       (0x1U << UART_CCR_B8TOG_Pos)                      /*!<UART sync frame transmission 9th bit auto roll control bit*/
#define  UART_CCR_B8TOG                           UART_CCR_B8TOG_Msk
#define  UART_CCR_B8EN_Pos                        (11)
#define  UART_CCR_B8EN_Msk                        (0x1U << UART_CCR_B8EN_Pos)                       /*!<UART sync frame 9th bit enable control bit. When the bit is enabled, the check enable bit PEN does not work*/
#define  UART_CCR_B8EN                            UART_CCR_B8EN_Msk
#define  UART_CCR_RWU_Pos                         (12)
#define  UART_CCR_RWU_Msk                         (0x1U << UART_CCR_RWU_Pos)                        /*!<Receiver in mute mode This bit is used to determine whether to put UART in the mute mode. This bit can be set or cleared by the software. When the wake-up sequence is available, the hardware will also clear it*/
#define  UART_CCR_RWU                             UART_CCR_RWU_Msk
#define  UART_CCR_WAKE_Pos                        (13)
#define  UART_CCR_WAKE_Msk                        (0x1U << UART_CCR_WAKE_Pos)                       /*!<Wake-up method. This bit determines UART wake-up method*/
#define  UART_CCR_WAKE                            UART_CCR_WAKE_Msk
#define  UART_CCR_LIN_Pos                         (14)
#define  UART_CCR_LIN_Msk                         (0x1U << UART_CCR_LIN_Pos)                        /*!<UART LIN protocol receipt and transmission Break frame*/
#define  UART_CCR_LIN                             UART_CCR_LIN_Msk

/**
  * @brief UART_BRR Register Bit Definition
  */
#define  UART_BRR_DIV_Mantissa_Pos                (0)
#define  UART_BRR_DIV_Mantissa_Msk                (0xFFFFU << UART_BRR_DIV_Mantissa_Pos)            /*!<Integer These 16 bits define the integer of UART divider factor (UARTDIV) DIV_Mantissa min value 1*/
#define  UART_BRR_DIV_Mantissa                    UART_BRR_DIV_Mantissa_Msk
#define  UART_BRR_DIV_Mantissa_0                  (0x0001U << UART_BRR_DIV_Mantissa_Pos) 
#define  UART_BRR_DIV_Mantissa_1                  (0x0002U << UART_BRR_DIV_Mantissa_Pos) 
#define  UART_BRR_DIV_Mantissa_2                  (0x0004U << UART_BRR_DIV_Mantissa_Pos) 
#define  UART_BRR_DIV_Mantissa_3                  (0x0008U << UART_BRR_DIV_Mantissa_Pos) 
#define  UART_BRR_DIV_Mantissa_4                  (0x0010U << UART_BRR_DIV_Mantissa_Pos) 
#define  UART_BRR_DIV_Mantissa_5                  (0x0020U << UART_BRR_DIV_Mantissa_Pos) 
#define  UART_BRR_DIV_Mantissa_6                  (0x0040U << UART_BRR_DIV_Mantissa_Pos) 
#define  UART_BRR_DIV_Mantissa_7                  (0x0080U << UART_BRR_DIV_Mantissa_Pos) 
#define  UART_BRR_DIV_Mantissa_8                  (0x0100U << UART_BRR_DIV_Mantissa_Pos) 
#define  UART_BRR_DIV_Mantissa_9                  (0x0200U << UART_BRR_DIV_Mantissa_Pos) 
#define  UART_BRR_DIV_Mantissa_10                 (0x0400U << UART_BRR_DIV_Mantissa_Pos) 
#define  UART_BRR_DIV_Mantissa_11                 (0x0800U << UART_BRR_DIV_Mantissa_Pos) 
#define  UART_BRR_DIV_Mantissa_12                 (0x1000U << UART_BRR_DIV_Mantissa_Pos) 
#define  UART_BRR_DIV_Mantissa_13                 (0x2000U << UART_BRR_DIV_Mantissa_Pos) 
#define  UART_BRR_DIV_Mantissa_14                 (0x4000U << UART_BRR_DIV_Mantissa_Pos) 
#define  UART_BRR_DIV_Mantissa_15                 (0x8000U << UART_BRR_DIV_Mantissa_Pos) 

/**
  * @brief UART_FRA Register Bit Definition
  */
#define  UART_FRA_DIV_FRACTION_Pos                (0)
#define  UART_FRA_DIV_FRACTION_Msk                (0xFU << UART_FRA_DIV_FRACTION_Pos)               /*!<UARTDIV Fraction setting The low 4 bits define the decimal of UART divider factor (UARTDIV)*/
#define  UART_FRA_DIV_FRACTION                    UART_FRA_DIV_FRACTION_Msk
#define  UART_FRA_DIV_FRACTION_0                  (0x1U << UART_FRA_DIV_FRACTION_Pos) 
#define  UART_FRA_DIV_FRACTION_1                  (0x2U << UART_FRA_DIV_FRACTION_Pos) 
#define  UART_FRA_DIV_FRACTION_2                  (0x4U << UART_FRA_DIV_FRACTION_Pos) 
#define  UART_FRA_DIV_FRACTION_3                  (0x8U << UART_FRA_DIV_FRACTION_Pos) 

/**
  * @brief UART_RXADDR Register Bit Definition
  */
#define  UART_RXADDR_RXADDR_Pos                   (0)
#define  UART_RXADDR_RXADDR_Msk                   (0xFFU << UART_RXADDR_RXADDR_Pos)                 /*!<UART sync frame data host match address In case of RXMASK =0xFF, the received sync frame data is same as the host match address, produce RXB8_INTF. The address 0 is broadcast address, and will respond after receipt.*/
#define  UART_RXADDR_RXADDR                       UART_RXADDR_RXADDR_Msk
#define  UART_RXADDR_RXADDR_0                     (0x01U << UART_RXADDR_RXADDR_Pos) 
#define  UART_RXADDR_RXADDR_1                     (0x02U << UART_RXADDR_RXADDR_Pos) 
#define  UART_RXADDR_RXADDR_2                     (0x04U << UART_RXADDR_RXADDR_Pos) 
#define  UART_RXADDR_RXADDR_3                     (0x08U << UART_RXADDR_RXADDR_Pos) 
#define  UART_RXADDR_RXADDR_4                     (0x10U << UART_RXADDR_RXADDR_Pos) 
#define  UART_RXADDR_RXADDR_5                     (0x20U << UART_RXADDR_RXADDR_Pos) 
#define  UART_RXADDR_RXADDR_6                     (0x40U << UART_RXADDR_RXADDR_Pos) 
#define  UART_RXADDR_RXADDR_7                     (0x80U << UART_RXADDR_RXADDR_Pos) 

/**
  * @brief UART_RXMASK Register Bit Definition
  */
#define  UART_RXMASK_RXMASK_Pos                   (0)
#define  UART_RXMASK_RXMASK_Msk                   (0xFFU << UART_RXMASK_RXMASK_Pos)                 /*!<When the data bits are all "0", any receipt data will produce sync frame interrupt request (RXB8_INTF). If the data bits whichone is "1", then the corresponding bit in RDR and RXADDR has to be the same, only that can produce the sync frame interrupt request.*/
#define  UART_RXMASK_RXMASK                       UART_RXMASK_RXMASK_Msk
#define  UART_RXMASK_RXMASK_0                     (0x01U << UART_RXMASK_RXMASK_Pos) 
#define  UART_RXMASK_RXMASK_1                     (0x02U << UART_RXMASK_RXMASK_Pos) 
#define  UART_RXMASK_RXMASK_2                     (0x04U << UART_RXMASK_RXMASK_Pos) 
#define  UART_RXMASK_RXMASK_3                     (0x08U << UART_RXMASK_RXMASK_Pos) 
#define  UART_RXMASK_RXMASK_4                     (0x10U << UART_RXMASK_RXMASK_Pos) 
#define  UART_RXMASK_RXMASK_5                     (0x20U << UART_RXMASK_RXMASK_Pos) 
#define  UART_RXMASK_RXMASK_6                     (0x40U << UART_RXMASK_RXMASK_Pos) 
#define  UART_RXMASK_RXMASK_7                     (0x80U << UART_RXMASK_RXMASK_Pos) 

/**
  * @brief UART_SCR Register Bit Definition
  */
#define  UART_SCR_SCEN_Pos                        (0)
#define  UART_SCR_SCEN_Msk                        (0x1U << UART_SCR_SCEN_Pos)                       /*!<ISO7816 enable control bit*/
#define  UART_SCR_SCEN                            UART_SCR_SCEN_Msk
#define  UART_SCR_SCAEN_Pos                       (1)
#define  UART_SCR_SCAEN_Msk                       (0x1U << UART_SCR_SCAEN_Pos)                      /*!<ISO7816 check auto response bit*/
#define  UART_SCR_SCAEN                           UART_SCR_SCAEN_Msk
#define  UART_SCR_NACK_Pos                        (2)
#define  UART_SCR_NACK_Msk                        (0x1U << UART_SCR_NACK_Pos)                       /*!<Active receipt frame response bit Receipt low level during protection period,this bit will be set to 1 by hardware.*/
#define  UART_SCR_NACK                            UART_SCR_NACK_Msk
#define  UART_SCR_SCFCNT_Pos                      (4)
#define  UART_SCR_SCFCNT_Msk                      (0xFFU << UART_SCR_SCFCNT_Pos)                    /*!<ISO7816 protection counter. During data transmission, the time to delay TXC flag bit assertion when the current data transmission by the register finished. Before reaching the count period, the transmitter will disable the start bit for the next data.*/
#define  UART_SCR_SCFCNT                          UART_SCR_SCFCNT_Msk
#define  UART_SCR_SCFCNT_0                        (0x01U << UART_SCR_SCFCNT_Pos) 
#define  UART_SCR_SCFCNT_1                        (0x02U << UART_SCR_SCFCNT_Pos) 
#define  UART_SCR_SCFCNT_2                        (0x04U << UART_SCR_SCFCNT_Pos) 
#define  UART_SCR_SCFCNT_3                        (0x08U << UART_SCR_SCFCNT_Pos) 
#define  UART_SCR_SCFCNT_4                        (0x10U << UART_SCR_SCFCNT_Pos) 
#define  UART_SCR_SCFCNT_5                        (0x20U << UART_SCR_SCFCNT_Pos) 
#define  UART_SCR_SCFCNT_6                        (0x40U << UART_SCR_SCFCNT_Pos) 
#define  UART_SCR_SCFCNT_7                        (0x80U << UART_SCR_SCFCNT_Pos) 
#define  UART_SCR_HDSEL_Pos                       (12)
#define  UART_SCR_HDSEL_Msk                       (0x1U << UART_SCR_HDSEL_Pos)                      /*!<Single wire half duplex mode selection*/
#define  UART_SCR_HDSEL                           UART_SCR_HDSEL_Msk

/**
  * @brief UART_IDLR Register Bit Definition
  */
#define  UART_IDLR_IDLR_Pos                       (0)
#define  UART_IDLR_IDLR_Msk                       (0xFFFFU << UART_IDLR_IDLR_Pos)                   /*!<UART idle data length register Data length is not allowed to set as 0.*/
#define  UART_IDLR_IDLR                           UART_IDLR_IDLR_Msk
#define  UART_IDLR_IDLR_0                         (0x0001U << UART_IDLR_IDLR_Pos) 
#define  UART_IDLR_IDLR_1                         (0x0002U << UART_IDLR_IDLR_Pos) 
#define  UART_IDLR_IDLR_2                         (0x0004U << UART_IDLR_IDLR_Pos) 
#define  UART_IDLR_IDLR_3                         (0x0008U << UART_IDLR_IDLR_Pos) 
#define  UART_IDLR_IDLR_4                         (0x0010U << UART_IDLR_IDLR_Pos) 
#define  UART_IDLR_IDLR_5                         (0x0020U << UART_IDLR_IDLR_Pos) 
#define  UART_IDLR_IDLR_6                         (0x0040U << UART_IDLR_IDLR_Pos) 
#define  UART_IDLR_IDLR_7                         (0x0080U << UART_IDLR_IDLR_Pos) 
#define  UART_IDLR_IDLR_8                         (0x0100U << UART_IDLR_IDLR_Pos) 
#define  UART_IDLR_IDLR_9                         (0x0200U << UART_IDLR_IDLR_Pos) 
#define  UART_IDLR_IDLR_10                        (0x0400U << UART_IDLR_IDLR_Pos) 
#define  UART_IDLR_IDLR_11                        (0x0800U << UART_IDLR_IDLR_Pos) 
#define  UART_IDLR_IDLR_12                        (0x1000U << UART_IDLR_IDLR_Pos) 
#define  UART_IDLR_IDLR_13                        (0x2000U << UART_IDLR_IDLR_Pos) 
#define  UART_IDLR_IDLR_14                        (0x4000U << UART_IDLR_IDLR_Pos) 
#define  UART_IDLR_IDLR_15                        (0x8000U << UART_IDLR_IDLR_Pos) 

/**
  * @brief UART_ABRCR Register Bit Definition
  */
#define  UART_ABRCR_ABREN_Pos                     (0)
#define  UART_ABRCR_ABREN_Msk                     (0x1U << UART_ABRCR_ABREN_Pos)                    /*!<Auto baud rate enable Enable auto baud rate only when UART is idle. After enabling, detect the edge of the receipt signal. After auto detection of auto baud rate, the hardware auto sets UART_BRR and UART_FRA register.*/
#define  UART_ABRCR_ABREN                         UART_ABRCR_ABREN_Msk
#define  UART_ABRCR_ABR_BITCNT_Pos                (1)
#define  UART_ABRCR_ABR_BITCNT_Msk                (0x3U << UART_ABRCR_ABR_BITCNT_Pos)               /*!<Auto baud rate detection length Detect the bit length between the previous edge and the following edge.*/
#define  UART_ABRCR_ABR_BITCNT                    UART_ABRCR_ABR_BITCNT_Msk
#define  UART_ABRCR_ABR_BITCNT_MODE0              (0x00U << UART_ABRCR_ABR_BITCNT_Pos)              /*!< Automatic baud rate length detection 1 */
#define  UART_ABRCR_ABR_BITCNT_MODE1              (0x01U << UART_ABRCR_ABR_BITCNT_Pos)              /*!< Automatic baud rate length detection 2 */
#define  UART_ABRCR_ABR_BITCNT_MODE2              (0x02U << UART_ABRCR_ABR_BITCNT_Pos)              /*!< Automatic baud rate length detection 4 */
#define  UART_ABRCR_ABR_BITCNT_MODE3              (0x03U << UART_ABRCR_ABR_BITCNT_Pos)              /*!< Automatic baud rate length detection 8 */
#define  UART_ABRCR_FORMER_EDGE_Pos               (3)
#define  UART_ABRCR_FORMER_EDGE_Msk               (0x1U << UART_ABRCR_FORMER_EDGE_Pos)              /*!<One edge selection before the auto baud rate*/
#define  UART_ABRCR_FORMER_EDGE                   UART_ABRCR_FORMER_EDGE_Msk
#define  UART_ABRCR_LATTER_EDGE_Pos               (4)
#define  UART_ABRCR_LATTER_EDGE_Msk               (0x1U << UART_ABRCR_LATTER_EDGE_Pos)              /*!<One edge selection after the auto baud rate*/
#define  UART_ABRCR_LATTER_EDGE                   UART_ABRCR_LATTER_EDGE_Msk

/** ------------------------------------------------------------------------------------------------------------------*/
#endif
/** ------------------------------------------------------------------------------------------------------------------*/
